; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=4, packages=9, locations=11, density=0.18181818181818182, fully_connected=False, max_capacity=2, out_folder=./sparse/training, instance_id=55, seed=96

(define (problem transport-55)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l2)
    (at p2 l6)
    (at p3 l1)
    (at p4 l1)
    (at p5 l3)
    (at p6 l7)
    (at p7 l11)
    (at p8 l6)
    (at p9 l2)
    (at v1 l5)
    (at v2 l6)
    (at v3 l6)
    (at v4 l5)
    (road l4 l9)
    (road l11 l5)
    (road l8 l6)
    (road l7 l4)
    (road l7 l10)
    (road l6 l8)
    (road l9 l4)
    (road l11 l1)
    (road l11 l7)
    (road l2 l7)
    (road l1 l11)
    (road l6 l7)
    (road l7 l6)
    (road l3 l2)
    (road l4 l7)
    (road l5 l11)
    (road l10 l7)
    (road l2 l3)
    (road l7 l2)
    (road l7 l11)
    )
 (:goal  (and 
    (at p1 l11)
    (at p2 l1)
    (at p3 l3)
    (at p4 l11)
    (at p5 l1)
    (at p6 l6)
    (at p7 l3)
    (at p8 l11)
    (at p9 l9))))

; plan
1. (pick-up v3 l6 p2 c1 c2)
   deleted: (at p2 l6) (capacity v3 c2)
   added: (in p2 v3) (capacity v3 c1)
   goals met: 0 of 9
2. (pick-up v3 l6 p8 c0 c1)
   deleted: (at p8 l6) (capacity v3 c1)
   added: (in p8 v3) (capacity v3 c0)
   goals met: 0 of 9
3. (drive v3 l6 l7)
   deleted: (at v3 l6)
   added: (at v3 l7)
   goals met: 0 of 9
4. (drive v3 l7 l11)
   deleted: (at v3 l7)
   added: (at v3 l11)
   goals met: 0 of 9
5. (drop v3 l11 p8 c0 c1)
   deleted: (in p8 v3) (capacity v3 c0)
   added: (at p8 l11) (capacity v3 c1)
   goals met: 1 of 9
6. (drive v3 l11 l1)
   deleted: (at v3 l11)
   added: (at v3 l1)
   goals met: 1 of 9
7. (drop v3 l1 p2 c1 c2)
   deleted: (in p2 v3) (capacity v3 c1)
   added: (at p2 l1) (capacity v3 c2)
   goals met: 2 of 9
8. (pick-up v3 l1 p3 c1 c2)
   deleted: (at p3 l1) (capacity v3 c2)
   added: (in p3 v3) (capacity v3 c1)
   goals met: 2 of 9
9. (pick-up v3 l1 p4 c0 c1)
   deleted: (at p4 l1) (capacity v3 c1)
   added: (in p4 v3) (capacity v3 c0)
   goals met: 2 of 9
10. (drive v3 l1 l11)
   deleted: (at v3 l1)
   added: (at v3 l11)
   goals met: 2 of 9
11. (drop v3 l11 p4 c0 c1)
   deleted: (in p4 v3) (capacity v3 c0)
   added: (at p4 l11) (capacity v3 c1)
   goals met: 3 of 9
12. (pick-up v3 l11 p7 c0 c1)
   deleted: (at p7 l11) (capacity v3 c1)
   added: (in p7 v3) (capacity v3 c0)
   goals met: 3 of 9
13. (drive v3 l11 l7)
   deleted: (at v3 l11)
   added: (at v3 l7)
   goals met: 3 of 9
14. (drive v3 l7 l2)
   deleted: (at v3 l7)
   added: (at v3 l2)
   goals met: 3 of 9
15. (drive v3 l2 l3)
   deleted: (at v3 l2)
   added: (at v3 l3)
   goals met: 3 of 9
16. (drop v3 l3 p3 c0 c1)
   deleted: (in p3 v3) (capacity v3 c0)
   added: (at p3 l3) (capacity v3 c1)
   goals met: 4 of 9
17. (drop v3 l3 p7 c1 c2)
   deleted: (in p7 v3) (capacity v3 c1)
   added: (at p7 l3) (capacity v3 c2)
   goals met: 5 of 9
18. (pick-up v3 l3 p5 c1 c2)
   deleted: (at p5 l3) (capacity v3 c2)
   added: (in p5 v3) (capacity v3 c1)
   goals met: 5 of 9
19. (drive v3 l3 l2)
   deleted: (at v3 l3)
   added: (at v3 l2)
   goals met: 5 of 9
20. (pick-up v3 l2 p1 c0 c1)
   deleted: (at p1 l2) (capacity v3 c1)
   added: (in p1 v3) (capacity v3 c0)
   goals met: 5 of 9
21. (drive v3 l2 l7)
   deleted: (at v3 l2)
   added: (at v3 l7)
   goals met: 5 of 9
22. (drive v3 l7 l11)
   deleted: (at v3 l7)
   added: (at v3 l11)
   goals met: 5 of 9
23. (drop v3 l11 p1 c0 c1)
   deleted: (in p1 v3) (capacity v3 c0)
   added: (at p1 l11) (capacity v3 c1)
   goals met: 6 of 9
24. (drive v3 l11 l1)
   deleted: (at v3 l11)
   added: (at v3 l1)
   goals met: 6 of 9
25. (drop v3 l1 p5 c1 c2)
   deleted: (in p5 v3) (capacity v3 c1)
   added: (at p5 l1) (capacity v3 c2)
   goals met: 7 of 9
26. (drive v2 l6 l7)
   deleted: (at v2 l6)
   added: (at v2 l7)
   goals met: 7 of 9
27. (pick-up v2 l7 p6 c1 c2)
   deleted: (at p6 l7) (capacity v2 c2)
   added: (in p6 v2) (capacity v2 c1)
   goals met: 7 of 9
28. (drive v2 l7 l6)
   deleted: (at v2 l7)
   added: (at v2 l6)
   goals met: 7 of 9
29. (drop v2 l6 p6 c1 c2)
   deleted: (in p6 v2) (capacity v2 c1)
   added: (at p6 l6) (capacity v2 c2)
   goals met: 8 of 9
30. (drive v2 l6 l7)
   deleted: (at v2 l6)
   added: (at v2 l7)
   goals met: 8 of 9
31. (drive v2 l7 l2)
   deleted: (at v2 l7)
   added: (at v2 l2)
   goals met: 8 of 9
32. (pick-up v2 l2 p9 c1 c2)
   deleted: (at p9 l2) (capacity v2 c2)
   added: (in p9 v2) (capacity v2 c1)
   goals met: 8 of 9
33. (drive v2 l2 l7)
   deleted: (at v2 l2)
   added: (at v2 l7)
   goals met: 8 of 9
34. (drive v2 l7 l4)
   deleted: (at v2 l7)
   added: (at v2 l4)
   goals met: 8 of 9
35. (drive v2 l4 l9)
   deleted: (at v2 l4)
   added: (at v2 l9)
   goals met: 8 of 9
36. (drop v2 l9 p9 c1 c2)
   deleted: (in p9 v2) (capacity v2 c1)
   added: (at p9 l9) (capacity v2 c2)
   goals met: 9 of 9
